---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCGuidKey.IFCGlobalId
source: html/de2ce671-4951-8035-9538-2e397577e39e.htm
---
# Autodesk.Revit.DB.IFC.IFCGuidKey.IFCGlobalId Property

IFC GlobalId for map.

## Syntax (C#)
```csharp
public string IFCGlobalId { get; }
```